package com.javarush.test.level12.lesson04.task03;

/* Пять методов print с разными параметрами
Написать пять методов print с разными параметрами.
*/

public class Solution
{
    public static void main(String[] args)
    {

    }

    //Напишите тут ваши методы
    public void print(int a){System.out.println("int");}
    public void print(String a){System.out.println("int");}
    public void print(boolean a){System.out.println("int");}
    public void print(long a){System.out.println("int");}
    public void print(double a){System.out.println("int");}

}
